---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.CutType
source: html/f8deeb24-237f-5e25-7524-2dae5cc27142.htm
---
# Autodesk.Revit.DB.FabricationPart.CutType Property

The cut type of the fabrication part.

## Syntax (C#)
```csharp
public int CutType { get; }
```